<?php

namespace Database\Seeders;

use App\Models\Usuario;
use Illuminate\Database\Seeder;

class UsuarioSeeder extends Seeder
{
    /**
     * Popula a tabela de usuários.
     */
    public function run(): void
    {
        /*
        |--------------------------------------------------------------------------
        | Usuários comuns
        |--------------------------------------------------------------------------
        */

        Usuario::factory()
            ->count(80)
            ->create();

        /*
        |--------------------------------------------------------------------------
        | Usuários participantes do marketing
        |--------------------------------------------------------------------------
        */

        Usuario::factory()
            ->count(15)
            ->marketing()
            ->create();

        /*
        |--------------------------------------------------------------------------
        | Usuários inativos
        |--------------------------------------------------------------------------
        */

        Usuario::factory()
            ->count(8)
            ->inativo()
            ->create();

        /*
        |--------------------------------------------------------------------------
        | Usuários bloqueados
        |--------------------------------------------------------------------------
        */

        Usuario::factory()
            ->count(3)
            ->bloqueado()
            ->create();

        /*
        |--------------------------------------------------------------------------
        | Usuários sem confirmação de e-mail
        |--------------------------------------------------------------------------
        */

        Usuario::factory()
            ->count(5)
            ->naoVerificado()
            ->create();

        /*
        |--------------------------------------------------------------------------
        | Usuários com foto
        |--------------------------------------------------------------------------
        */

        Usuario::factory()
            ->count(20)
            ->comFoto()
            ->create();

        /*
        |--------------------------------------------------------------------------
        | Usuários com token "Lembrar-me"
        |--------------------------------------------------------------------------
        */

        Usuario::factory()
            ->count(10)
            ->comRememberToken()
            ->create();
    }
}